# Даны два числа a и b. Используя форматирование строк:
# выведите на экран их сумму и произведение в форматах 'a + b = c' и 'a * b = c'
# Тут, как говорится, комментарии излишни))

a = 5
b = 7

print(f'''Сумма: {a} + {b} = {a + b}\nПроизведение: {a} * {b} = {a * b}''')
